# საინტერაციო ცვლადი - ის ცვლადი რომელიც ყოველ ჯერზე იზრდება


# sum = 0

# for i in range(1,20):
#     sum = sum + i 
# i - აღნიშნავს ინტერაციის რაოდენობას
# print(sum)

#  დავადეკლარიდედ ცვლადი რომელსაც მივანიჭეთ 0 მნიშვნელობა შემდეგ შევქმენით ციკლი რომელიც განმეორდება 20 ჯერ , შემდეგ ჩვენს ცვლადს მივანიჭედ თავის მნიშვნელობას დამატებული საინტერაციო ცვლადი, და  დავპრინტეთ


# 1) ერთიდან 50 მდე დაბეჭდეთ რიცხვების საშუალო არითმეტიკული

sum = 0 
for i in range(1,51):
   sum = sum + i
print(sum // 50)


# 2) მომხმარებელს შემოატანინეთ რიცხვი შემდეგ კი 
# მომხმარებლიშემოტანილ რიცვამდე დაბეჭდეთ ყველა ლუწი რიცხვი

num = int(input("enter number "))

for i in range(0,num):
   if i % 2 == 0:
      print(i)


# 3) მომხმარებელს შემოატანინეთ რიცხვი შემდეგ კი მომხარებ5ლის შემოტანილ რიცხვამდე დაბეჭდეთ ყველა რიცხვის საშუალო არითმეტიკული 

num = int(input("enter number "))
sum = 0
for i in range(1,num + 1):
   sum = sum + i
   print(sum / num)