# 3) შექმენით ფუნქცია manual_pop, რომელსაც გადაეცემა ორი არგუმენტი, სია და ინდექსი. წაშალეთ სიიდან, გადმოცემულ ინდექსზე მყოფი ელემენტი. საბოლოოდ კი დააბრუნეთ ეს სია(არ გამოიყენოთ .pop ფუნქცია)

def manual_pop(lst,index):
    result = []
    for i in range(len(lst)):
        if i != index:  # სიის იმ ელემენტებს დავამატებთ ახალ სიაში რომელთა ინდექსიც არ ემთხვევა წასაშლელ სიას , რეალურად ჩვენ არ ვშლით ელემენტს, უბრალოდ ინდექსში მყოფი ელემენტის  გარდა ყველა ელემენტი გადაგვაქვს ახალ სიაში და შემდეგ ვბეჭდავთ მას.
            result.append(lst[i])
    return result

print(manual_pop([0,1,2,3,4,5], 3))


                
                   