#  1) შექმენი ცვლადი my_number და მიაწერე რიცხვი 10. 
# დაბეჭდე ცვლადის მნიშვნელობა.
# 2)შექმენი ცვლადი my_text და მიაწერე მას ტექსტი "Hello, World!". დაბეჭდე ცვლადის ტიპი.

# 3)შექმენი ორი ცვლადი num1 და num2, და მიაწერე მათ 5 და 15. დაბეჭდე მათ ჯამი.

# 4)შექმენი ორი ცვლადი first_name და last_name და მიაწერე მათ შესაბამისი სახელები. დაბეჭდე ორივე ერთად.

# 5)შექმენი ცვლადი age და მიაწერე მას 8. შემდეგ შეცვალე მისი მნიშვნელობა 9-ზე და დაბეჭდე ახალი მნიშვნელობა.  

# 6) შექმენი ცვლადი, str_num და შეინახეთ “10”, მოცემული ცვლადი გადაიყვანეთ ინტეჯერში და შემდეგ გაამრავლეთ ექვსზე

# 7) შექმენი ცვლადები num1 და num2, ამ ცვლადებში შეინახეთ: “10” და “5”, შემდეგ გადაიყვანეთ ინტეჯერებში და გადაამრავლეთ

# 8) შექმენით რამოდენიმე ცვლადი მინიმუმ 5 რომლებშიც შეინახავთ რიცხვებს შემდეგ კი დაბეჭდეთ მათი საშუალო არითმეტიკული.

# 1)
my_number = "10"
print(my_number)

# 2)
my_text = "Hello, world!"
print(my_text)

# 3)
num1 = "5"
num2 = "10"
print(num1 + " + " + num2 + " = " + str(int(num1) + int(num2)))

# num3 = 5
# num4 = 10
# print(str(num3) + " + " + str(num4) + " = " + str(num3 + num4))

# 4)
First_name = "Deme"
Last_name = "Mamuladze"
print(First_name + " " + Last_name)

# 5)
age = "8"
age = "9"
print(age)

# 6)  ვერ გავიგე

# 7)
numb1 = 10
numb2 = 5
print(str(numb1) + " * " + str(numb2) + " = " + str(numb1 * numb2))

# 8) ჯერ არ გამივლია საშუალო არითმეტიკულის გამოთვლა
# num1 = "25"
# num2 = "30"
# num3 = "40"
# num4 = "50"
# num5 = "55"
# num6 = "60"

