# 1) შექმენით კალკულატორი, მომხმარებელს შეეკითხეთ ორი რიცხვი, შემდეგ შეეკითხეთ რა მოქმედების შესრულება სურს ამ ორ რიცხვზე და მისი პასუხიდან გამომდინარე შეასრულეთ მოქმედება და დაბეჭდეთ მაგალითად თუ მომხმარებელი შემოიტანს რიცხვებს 5 და 7 , და შემოიტანს მოქმედებას მაგალითად დამატებას თქვენ უნდა დაუბეჭდოთ 5 + 7 = 12

num1 = int(input("enter number "))
num2 = int(input("enter second number "))
operation = input("choose operation: +, -, *, / ")

if operation == "+":      
    print(num1 + num2)
    # თუ მომხმარებლის მიერ არჩეული ოპერაცია იქნება + მაშინ მოხდება შეკრების ოპერაცია  print(num1 + num2)

elif operation == "-":
    print(num1 - num2)
    # თუ მომხმარებლის მიერ არჩეული ოპერაცია იქნება - მაშინ შესრულდება გამოკლების ოპერაცია  print(num1 - num2)

elif operation == "*":
    print(num1 * num2)
    # თუ მომხმარებლის მიერ არჩეული ოპერაცია იქნება + მაშინ შესრულდება გამრავლების ოპერაცია  print(num1 * num2)

elif operation == "/":
    print(num1 / num2)
    # თუ მომხმარებლის მიერ არჩეული ოპერაცია იქნება / მაშინ შესრულდება გაყოფის ოპერაცია  print(num1 / num2)

else:
    print("error try again")
    # ნებისმიერი სხვა ინფორმაციის შეყვანისას პასუხი იქნება  "error try again"
