# დავალება: მომხმარებელს შემოატანინეთ 2 რიცხვი, ხოლო შემდეგ გაკეთეთ ამ რიცხვებზე ყველა მათემატიკური ოპერაცია ცალცალკე.
num1 = int(input("enter number: "))
num2 = int(input("enter number 2: "))
print(num1 + num2)
print(num1 - num2)
print(num1 * num2)
print(num1 / num2)

# დავალება: კომენტარიბის სახით ახსენით თქვენი სიტყვებით, რა არის input, და output
# input -ინფორმაცია რომელსაც ჩვენ ვაწვდით კომპიუტერ output - ინფორმაცია რომელსაც ვიღებთ კომპიუტერისგან


# დავალება: მომხმარებელს შემოატანინეთ თავისი სახელი და გავარი, შემდეგ კი ტერმინალში გამოიტანეთ მომხმარებლის შემოტანილი მნიშვნელობები

name = input("enter your name: ")
surname = input("enter your surname: ")
print(name + " " + surname)

